import client from "./client";
// test 비동기 요청하는 곳
export const getpatientAPI = () => {
  console.log("비동기 요청(환자)");
  let DummyData = {
    dummy: [
      {
        mv: {
          type: "NM",
          unit: "L/min",
          value: 1,
        },
        rr: {
          type: "NM",
          unit: "bpm",
          value: 19,
        },
        rvs: {
          type: "NA",
          unit: "mL",
          value: [
            60.93251821, 50.63870761, 70.46560705, 70.16751479, 50.05741148,
            60.37236984, 50.53056866, 70.55610713,
          ],
        },
        spo2: {
          type: "NM",
          unit: "%",
          value: 1,
        },
        tv: {
          type: "NM",
          unit: "mL",
          value: 449867.99999999994,
        },
      },
      {
        mv: {
          type: "NM",
          unit: "L/min",
          value: 2,
        },
        rr: {
          type: "NM",
          unit: "bpm",
          value: 19,
        },
        rvs: {
          type: "NA",
          unit: "mL",
          value: [
            83766671.93251821, 83703921.63870761, 83779506.46560705,
            83684245.16751479, 83630464.05741148, 83665499.37236984,
            83568326.53056866, 83588762.55610713,
          ],
        },
        spo2: {
          type: "NM",
          unit: "%",
          value: 1,
        },
        tv: {
          type: "NM",
          unit: "mL",
          value: 449867.99999999994,
        },
      },
      {
        mv: {
          type: "NM",
          unit: "L/min",
          value: 3,
        },
        rr: {
          type: "NM",
          unit: "bpm",
          value: 19,
        },
        rvs: {
          type: "NA",
          unit: "mL",
          value: [
            83766671.93251821, 83703921.63870761, 83779506.46560705,
            83684245.16751479, 83630464.05741148, 83665499.37236984,
            83568326.53056866, 83588762.55610713,
          ],
        },
        spo2: {
          type: "NM",
          unit: "%",
          value: 1,
        },
        tv: {
          type: "NM",
          unit: "mL",
          value: 449867.99999999994,
        },
      },
      {
        mv: {
          type: "NM",
          unit: "L/min",
          value: 4,
        },
        rr: {
          type: "NM",
          unit: "bpm",
          value: 19,
        },
        rvs: {
          type: "NA",
          unit: "mL",
          value: [
            83766671.93251821, 83703921.63870761, 83779506.46560705,
            83684245.16751479, 83630464.05741148, 83665499.37236984,
            83568326.53056866, 83588762.55610713,
          ],
        },
        spo2: {
          type: "NM",
          unit: "%",
          value: 1,
        },
        tv: {
          type: "NM",
          unit: "mL",
          value: 449867.99999999994,
        },
      },
      {
        mv: {
          type: "NM",
          unit: "L/min",
          value: 5,
        },
        rr: {
          type: "NM",
          unit: "bpm",
          value: 19,
        },
        rvs: {
          type: "NA",
          unit: "mL",
          value: [
            83766671.93251821, 83703921.63870761, 83779506.46560705,
            83684245.16751479, 83630464.05741148, 83665499.37236984,
            83568326.53056866, 83588762.55610713,
          ],
        },
        spo2: {
          type: "NM",
          unit: "%",
          value: 1,
        },
        tv: {
          type: "NM",
          unit: "mL",
          value: 449867.99999999994,
        },
      },
      {
        mv: {
          type: "NM",
          unit: "L/min",
          value: 6,
        },
        rr: {
          type: "NM",
          unit: "bpm",
          value: 19,
        },
        rvs: {
          type: "NA",
          unit: "mL",
          value: [
            83766671.93251821, 83703921.63870761, 83779506.46560705,
            83684245.16751479, 83630464.05741148, 83665499.37236984,
            83568326.53056866, 83588762.55610713,
          ],
        },
        spo2: {
          type: "NM",
          unit: "%",
          value: 1,
        },
        tv: {
          type: "NM",
          unit: "mL",
          value: 449867.99999999994,
        },
      },
      {
        mv: {
          type: "NM",
          unit: "L/min",
          value: 7,
        },
        rr: {
          type: "NM",
          unit: "bpm",
          value: 19,
        },
        rvs: {
          type: "NA",
          unit: "mL",
          value: [
            83766671.93251821, 83703921.63870761, 83779506.46560705,
            83684245.16751479, 83630464.05741148, 83665499.37236984,
            83568326.53056866, 83588762.55610713,
          ],
        },
        spo2: {
          type: "NM",
          unit: "%",
          value: 1,
        },
        tv: {
          type: "NM",
          unit: "mL",
          value: 449867.99999999994,
        },
      },
      {
        mv: {
          type: "NM",
          unit: "L/min",
          value: 8,
        },
        rr: {
          type: "NM",
          unit: "bpm",
          value: 19,
        },
        rvs: {
          type: "NA",
          unit: "mL",
          value: [
            83766671.93251821, 83703921.63870761, 83779506.46560705,
            83684245.16751479, 83630464.05741148, 83665499.37236984,
            83568326.53056866, 83588762.55610713,
          ],
        },
        spo2: {
          type: "NM",
          unit: "%",
          value: 1,
        },
        tv: {
          type: "NM",
          unit: "mL",
          value: 449867.99999999994,
        },
      },
      {
        mv: {
          type: "NM",
          unit: "L/min",
          value: 9,
        },
        rr: {
          type: "NM",
          unit: "bpm",
          value: 19,
        },
        rvs: {
          type: "NA",
          unit: "mL",
          value: [
            83766671.93251821, 83703921.63870761, 83779506.46560705,
            83684245.16751479, 83630464.05741148, 83665499.37236984,
            83568326.53056866, 83588762.55610713,
          ],
        },
        spo2: {
          type: "NM",
          unit: "%",
          value: 1,
        },
        tv: {
          type: "NM",
          unit: "mL",
          value: 449867.99999999994,
        },
      },
      {
        mv: {
          type: "NM",
          unit: "L/min",
          value: 10,
        },
        rr: {
          type: "NM",
          unit: "bpm",
          value: 19,
        },
        rvs: {
          type: "NA",
          unit: "mL",
          value: [
            83766671.93251821, 83703921.63870761, 83779506.46560705,
            83684245.16751479, 83630464.05741148, 83665499.37236984,
            83568326.53056866, 83588762.55610713,
          ],
        },
        spo2: {
          type: "NM",
          unit: "%",
          value: 1,
        },
        tv: {
          type: "NM",
          unit: "mL",
          value: 449867.99999999994,
        },
      },
      {
        mv: {
          type: "NM",
          unit: "L/min",
          value: 11,
        },
        rr: {
          type: "NM",
          unit: "bpm",
          value: 19,
        },
        rvs: {
          type: "NA",
          unit: "mL",
          value: [
            83766671.93251821, 83703921.63870761, 83779506.46560705,
            83684245.16751479, 83630464.05741148, 83665499.37236984,
            83568326.53056866, 83588762.55610713,
          ],
        },
        spo2: {
          type: "NM",
          unit: "%",
          value: 1,
        },
        tv: {
          type: "NM",
          unit: "mL",
          value: 449867.99999999994,
        },
      },
      {
        mv: {
          type: "NM",
          unit: "L/min",
          value: 12,
        },
        rr: {
          type: "NM",
          unit: "bpm",
          value: 19,
        },
        rvs: {
          type: "NA",
          unit: "mL",
          value: [
            83766671.93251821, 83703921.63870761, 83779506.46560705,
            83684245.16751479, 83630464.05741148, 83665499.37236984,
            83568326.53056866, 83588762.55610713,
          ],
        },
        spo2: {
          type: "NM",
          unit: "%",
          value: 1,
        },
        tv: {
          type: "NM",
          unit: "mL",
          value: 449867.99999999994,
        },
      },
      {
        mv: {
          type: "NM",
          unit: "L/min",
          value: 13,
        },
        rr: {
          type: "NM",
          unit: "bpm",
          value: 19,
        },
        rvs: {
          type: "NA",
          unit: "mL",
          value: [
            83766671.93251821, 83703921.63870761, 83779506.46560705,
            83684245.16751479, 83630464.05741148, 83665499.37236984,
            83568326.53056866, 83588762.55610713,
          ],
        },
        spo2: {
          type: "NM",
          unit: "%",
          value: 1,
        },
        tv: {
          type: "NM",
          unit: "mL",
          value: 449867.99999999994,
        },
      },
      {
        mv: {
          type: "NM",
          unit: "L/min",
          value: 14,
        },
        rr: {
          type: "NM",
          unit: "bpm",
          value: 19,
        },
        rvs: {
          type: "NA",
          unit: "mL",
          value: [
            83766671.93251821, 83703921.63870761, 83779506.46560705,
            83684245.16751479, 83630464.05741148, 83665499.37236984,
            83568326.53056866, 83588762.55610713,
          ],
        },
        spo2: {
          type: "NM",
          unit: "%",
          value: 1,
        },
        tv: {
          type: "NM",
          unit: "mL",
          value: 449867.99999999994,
        },
      },
      {
        mv: {
          type: "NM",
          unit: "L/min",
          value: 15,
        },
        rr: {
          type: "NM",
          unit: "bpm",
          value: 19,
        },
        rvs: {
          type: "NA",
          unit: "mL",
          value: [
            83766671.93251821, 83703921.63870761, 83779506.46560705,
            83684245.16751479, 83630464.05741148, 83665499.37236984,
            83568326.53056866, 83588762.55610713,
          ],
        },
        spo2: {
          type: "NM",
          unit: "%",
          value: 1,
        },
        tv: {
          type: "NM",
          unit: "mL",
          value: 449867.99999999994,
        },
      },
      {
        mv: {
          type: "NM",
          unit: "L/min",
          value: 16,
        },
        rr: {
          type: "NM",
          unit: "bpm",
          value: 19,
        },
        rvs: {
          type: "NA",
          unit: "mL",
          value: [
            83766671.93251821, 83703921.63870761, 83779506.46560705,
            83684245.16751479, 83630464.05741148, 83665499.37236984,
            83568326.53056866, 83588762.55610713,
          ],
        },
        spo2: {
          type: "NM",
          unit: "%",
          value: 1,
        },
        tv: {
          type: "NM",
          unit: "mL",
          value: 449867.99999999994,
        },
      },
    ],
  };
  return DummyData;
};
